{"pageProps":{"htmlString":"<h2 id=\"description\">Description</h2>\n<p>This IC is useful for medium power motor drivers or limited power thermoelectric coolers (peltier modules). It can be configured for duel or single applications with the latter provding almost double the power. Be aware that this module runs HOT so sufficient cooling is needed.</p>\n<p>For single motor mode, two digital pins are needed. For duel mode, 4 digital pins are needed. A I2C PWM breakout board such as the PCA9685 12-bit, 16-channel IC can be used if more digital pins are needed. This IC can have its I2C address configured to prevent conflicting addresses.</p>\n<p>Alternative component: DRV8871. A single motor driver for up to 3.6 A or 1.8 A continuous with cooling.</p>\n<h2 id=\"resources\">Resources</h2>\n<p>Pololu Website Guide: <a href=\"https://www.pololu.com/product/2999\">TB67H420FTG</a></p>\n<p><a href=\"https://www.youtube.com/watch?v=LH3bHMQEy7U\">Video</a> on connecting motor to Teensy microcontroller.</p>\n<p><a href=\"https://www.pololu.com/product/2999#lightbox-picture0J8689\">Schematic</a></p>\n<h2 id=\"setup\">Setup</h2>\n<h3 id=\"wiring\">Wiring</h3>\n<p>Single motor:</p>\n<ul>\n<li><p>INA1 = a digital pin</p>\n</li>\n<li><p>INA2 = a digital pin</p>\n</li>\n<li><p>PWMA = a digital pin</p>\n</li>\n<li><p>GND = Ground</p>\n</li>\n</ul>\n<p>Do not connect VCC to Teensy as this is a regulated power OUTPUT from the motors input voltage source!</p>\n<ul>\n<li><p>A+ and A- = should be connected together via a jumper</p>\n</li>\n<li><p>B+ and B- = should be connected together via a jumper</p>\n</li>\n<li><p>VIN = supply voltage (normally 12 V)</p>\n</li>\n<li><p>HBMode = should be connected to VCC (3.3 or 5 V) via a jumper</p>\n</li>\n</ul>\n<h2 id=\"current-limiting\">Current Limiting</h2>\n<p>The TB67H420FTG can actively limit the current through the motors by using a fixed-frequency PWM current regulation (current chopping). This carrier board connects voltage dividers to the VREFA and VREFB pins that set the reference voltage to about 3.6 V.</p>\n<p>In single-channel mode, the default 3.6 V reference voltage results in a nominal single-channel current limit of 9 A. The formula for the current chopping threshold in single-channel mode is Iout=VREF×2.5.</p>\n","data":{"title":"TB67H420FTG (H-Bridge / Motor/TEC Driver)"}},"__N_SSG":true}